Revit 2027 API
BuiltInFailures.StairRampFailures.MultistoryStairsHideTopLevelParameter Property
 You have set the stair's multistory top level to None, and Revit will remove this parameter, if you want to create a multistory stair, please use Create Multistory Stair feature.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId MultistoryStairsHideTopLevelParameter { get; }
Public Shared ReadOnly Property MultistoryStairsHideTopLevelParameter As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ MultistoryStairsHideTopLevelParameter {
	FailureDefinitionId^ get ();
}
static member MultistoryStairsHideTopLevelParameter : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.StairRampFailures Class
Autodesk.Revit.DB Namespace